In [1]:
import pandas as pd

In [10]:
df = pd.read_excel('penjualan.xlsx', usecols=[1, 2, 3], skiprows=[0])

In [11]:
df.head()

         TGL      PENJUALAN  JUMLAH
0 2019-08-10         Sarung    7000
1 2019-08-19         Kopeah   47400
2 2019-08-20          Dress   17500
3 2019-08-21  Ikat Pinggang   12500
4 2019-08-22           Dasi    2500

In [13]:
df.dtypes

TGL          datetime64[ns]
PENJUALAN            object
JUMLAH                int64
dtype: object

In [24]:
df.loc[0, 'JUMLAH'] = 47000

In [25]:
df

          TGL        PENJUALAN  JUMLAH
0  2019-08-10           Sarung   47000
1  2019-08-19           Kopeah   47400
2  2019-08-20            Dress   17500
3  2019-08-21    Ikat Pinggang   12500
4  2019-08-22             Dasi    2500
5  2019-08-22    Ikat Pinggang    2500
6  2019-09-04           Sarung    1500
7  2019-09-05    Ikat Pinggang    3500
8  2019-09-06  Sepatu Sneakers   10000
9  2019-09-09            Dress   25000
10 2019-09-11           Sarung   36000
11 2019-09-12             Dasi   28500

In [27]:
rekap_per_bulan = df.groupby(df.TGL.dt.month).sum()

In [28]:
rekap_per_bulan

     JUMLAH
TGL
8    129400
9    104500

In [30]:
df['JUMLAH'].sum()

233900

In [31]:
rekap_per_bulan.sum()

JUMLAH    233900
dtype: int64